import re

token = "528720694:AAH1z9G0kGn3XhArUCbJPzDgLohw08bWCo8"
GROUP_ID = -1001223980001
regexes = [
        # your regexes here
        # re.compile(r'(хуев|хуёв)(аст|)(еньк|)(ы(й|х|е|м)|о(е|го|й|му|)|ая|ий)', re.I),
        re.compile(r'(^бля| бля)', re.I),
        re.compile(r'(за|по|на|до|у|недо|)(бляд|блед|блид)(ищ|ун|ин|ств|у|овал|)(ю|ь|а|ы|ой|у|и|е|й|ей|ю|ем|я|о|а|у|ом|ам|ов|ы|ами|ий|ый|ого|ому|им|их|ить|ю|)', re.I),
        re.compile(r'(пидор|пидр)(ск|астическ|ил|ильск|)(а|у|ом|ам|ов|ы|ами|ий|ый|ого|ому|им|их|)', re.I),
        re.compile(r'(при|о|а|пре|по|на|)ху(есос|еплет|ев|ёв|ел|йн|ет|й|я|ю|и|ен)(аст|)(л|)(чик|еньк|ат|)(ани|)(ая|ый|ой|ому|о|а|ы|ой|я|и|е|й|ей|ю|ем|ый|ого|ому|ом|)', re.I),
        re.compile(r'(при|у|пре|за|)(пи|пе|пы)(зд|сд)(яч|)(о|ю|ён|ен|ищ|ятин|ат|ел|ил|ец|)(к|)(а|ы|ой|у|и|е|й|ей|ю|ем|я|о|а|у|ом|ам|ов|ы|ами|ий|ый|ого|ому|им|их|ить|ю|)', re.I), #пизда
        re.compile(r'(за|по|на|до|у|недо|вы)еб(а|)(ыва|уч|лив|нут|н|нн|)(о|)(ь|ешь|нуть|ет|й|)(ы(й|х|е|м)|и(я|и|е|го|й|му)|ая|ий|ся|юсь|ать|ал|ала|у|ем|ут|)', re.I), #ебать
        re.compile(r'(за|по|на|до|у|недо|)(еб|ёб)(ал|альц|лышк|лан|ен|анат|л|у|ут|ок|к)(я|ей|ям|ях|е|а|и|ут|у|ет|о|а|у|ом|)(и|)', re.I),
        #    re.compile(...),
        ]

#хуесос мразота
#Хренов(аст|)(еньк|)(ы(й|х|е|м)|о(е|го|й|му)|ая|ий)